Repository: Belfagor2005/BackupSuite
Catalog: usr/lib/enigma2/python/Plugins/Extensions/BackupSuite/locale/*/LC_MESSAGES/BackupSuite.po
Languages: it

source: No supported receiver found!
it: Non è stato trovato nessun ricevitore supportato!

source: BACK-UP TOOL, FOR MAKING A COMPLETE BACK-UP
it: STRUMENTO DI BACKUP, PER ESEGUIRE UN BACKUP COMPLETO

source: Please be patient, a backup will now be made, this will take about:
it: Si prega di essere pazienti, un backup sarà eseguito e impiegherà circa:

source: size to be backed up:
it: dimensione del backup:

source: not found, the backup process will be aborted!
it: non trovato, il processo di backup sarà annullato!

source: Some information about the task
it: Alcune informazioni sul processo

source: Create: root.ubifs
it: Creando: root.ubifs

source: Create: kerneldump
it: Creando: Kerneldump

source: Additional backup ->
it: Altri backup ->

source: USB Image created in:
it: Immagine USB creata in:

source: and there is made an extra copy in:
it: un'altra copia è stata creata in:

source: Please check the manual of the receiver on how to restore the image.
it: Controllare nel manuale del ricevitore come ripristinare l'immagine.

source: Image creation FAILED!
it: Creazione dell'immagine FALLITA!

source: available
it: disponibile

source: There is a valid USB-flashdrive detected in one of the USB-ports, therefore an extra copy of the back-up image will now be copied to that USB-flashdrive.
it: E' presente una chiavetta USB in una delle porte disponibili, per questo motivo un'altra copia dell'immagine sarà creata nella chiavetta USB.

source: This only takes about 20 seconds.....
it: Impiegherà circa 20 secondi.....

source: Backup finished and copied to your USB-flashdrive.
it: Il Backup è finito e sarà copiato nella chiavetta USB.

source: Full back-up to the harddisk
it: Backup completo su disco rigido

source: There is NO valid USB-stick found, so I've got nothing to do.
it: Non esiste una chiavetta USB valida, non è possibile fare niente.

source: PLEASE READ THIS:
it: LEGGERE PRIMA:

source: To back-up directly to the USB-stick, the USB-stick MUST contain a file with the name:
it: Per effettuare un backup completo su chiavetta USB è necessario creare un file con questo nome:

source: backupstick or
it: backupstick oppure

source: If you place an USB-stick containing this file then the back-up will be automatically made onto the USB-stick and can be used to restore the current image if necessary.
it: Se la chiavetta USB contiene questo file allora un backup sarà automaticamente creato sulla chiavetta USB e potrà essere usato per ripristinare l'attuale immagine se necessario.

source: The program will exit now.
it: Il programma terminerà ora.

source: Full back-up direct to USB
it: Backup completo su USB

source: The content of the folder is:
it: Il contenuto della cartella è:

source: Time required for this process:
it: Tempo richiesto per questo processo:

source: minutes
it: minuti

source: Backup done with:
it: Backup effettuato con:

source: KB per second
it: KB per secondi

source: Most likely this back-up can't be restored because of it's size, it's simply too big to restore. This is a limitation of the bootloader not of the back-up or the BackupSuite.
it: Probabilmente il backup non può essere ripristinato perché la dimensione è semplicemente troppo grande per essere ripristinata. Questa è una limitazione del bootloader e non del backup o di BackupSuite.

source: There COULD be a problem with restoring this back-up because the size of the back-up comes close to the maximum size. This is a limitation of the bootloader not of the back-up or the BackupSuite.
it: E' possibile che ci sia un problema nel ripristino dell'immagine poiché la dimensione del backup è vicina alla dimensione massima. Questa è una limitazione del bootloader e non del backup o di BackupSuite.

source: * * * WARNING * * *
it: * * * ATTENZIONE * * *

source: Not enough free space on
it: Non c'è abbastanza spazio libero su

source: to make a back-up!
it: per effettuare un backup!

source: MB available space
it: Spazio libero (MB)

source: MB needed space
it: Spazio necessario (MB)

source: The program will abort, please try another medium with more free space to create your back-up.
it: Il programma sarà terminato, usare un'altra unità che abbia più spazio per creare il vostro backup.

source: is not executable...
it: non è eseguibile ...

source: Using your own custom lookuptable.txt from the folder /etc
it: Usando il tuo lookuptable.txt personalizzato dalla cartella /etc

source: Version unknown, probably not installed the right way.
it: Versione sconosciuta, probabilmente non è installata nel modo giusto.

source: not installed yet, now installing
it: non ancora installata, ora la installo

source: Probably you are trying to make the back-up in flash memory
it: Probabilmente si sta tentando a fare il backup nella memoria flash

source: No additional USB-stick found to copy an extra backup
it: Nessuna chiavetta USB aggiuntiva trovata per copiare un backup extra

source: Installed packages contained in this backup:
it: Pacchetti installati contenuti in questo backup:

source: NFI Image created in:
it: Immagine NFI creata in:

source: Mount point does not exist! Please check your network share configuration.
it: Il punto di montaggio non esiste! Controlla la configurazione della condivisione di rete.

source: Not a mounted filesystem! Please mount the network share first.
it: Non è un file system montato! Monta prima la condivisione di rete.

source: Write permission denied! Check share permissions.
it: Permesso di scrittura negato! Controlla i permessi di condivisione.

source: Insufficient free space on NAS!
it: Non c'è abbastanza spazio libero su NAS!

source: Unable to create backup directories!
it: Impossibile creare directory di backup!

source: Unable to create the backup marker file!
it: Impossibile creare il file di backup del marcatore!

source: Full back-up to the MultiMediaCard
it: Backup completo su MultiMediaCard

source: Backup started...
it: Backup avviato...

source: Phase 1/3: Preparing backup environment
it: Fase 1/3: Preparazione dell'ambiente di backup

source: Phase 2/3: Creating backup image
it: Fase 2/3: Creazione dell'immagine di backup

source: Phase 3/3: Finalizing backup
it: Fase 3/3: Finalizzazione del backup

source: Backup completed successfully!
it: Backup completato con successo!

source: Backup statistics:
it: Statistiche di backup:

source: Backup size:
it: Dimensione del backup:

source: Backup progress:
it: Avanzamento del backup:

source: Backup created in:
it: Backup creato in:

source: Dumping kernel (25%)
it: Dumping del kernel (25%)

source: Creating root filesystem (50%)
it: Creazione del file system root (50%)

source: Assembling image (75%)
it: Assemblaggio Immagine(75%)

source: Making extra copy (90%)
it: Creazione di copie extra (90%)

source: Finalizing (95%)
it: Finalizzazione (95%)

source: Backup complete (100%)
it: Backup completo (100%)

source: USB Storage
it: Memoria USB

source: Network Storage
it: Memoria NETWORK

source: Restore Backup
it: Ripristinare backup

source: Make or restore a backup
it: Eseguire o ripristinare un backup

source: Close
it: Chiudere

source: Restore
it: Ripristino

source: Help
it: Aiuto

source: Missing backup scripts: {0} Please reinstall the BackupSuite plugin.
it: Script di backup mancanti: {0} Reinstallare il plugin BackupSuite.

source: Backup to {0}
it: Backup in {0}

source: Backup to Network
it: Backup su archiviazione Network

source: Do you want to make a backup to {0}? This may take several minutes.
it: Vuoi effettuare un backup su {0}? L'operazione potrebbe richiedere diversi minuti.

source: Backup script not found for {0}: {1}
it: Script di backup non trovato per {0}: {1}

source: No network shares mounted! Please mount a share first.
it: Nessuna condivisione di rete montata! Montare prima una condivisione.

source: Free:
it: Liberi:

source: Total:
it: Totale:

source: Select network share for backup:
it: Selezionare la cartella con backup:

source: Could not create backup directory: {0} Error: {1}
it: Impossibile creare la directory di backup: {0} Errore: {1}

source: No write permission for: {0}
it: Nessun permesso di scrittura per: {0}

source: Backup failed: Not enough free space on device!
it: Backup non riuscito: spazio libero sul dispositivo insufficiente!

source: Backup failed: Write permission denied!
it: Backup non riuscito: autorizzazione di scrittura negata!

source: Backup failed: Device is read-only!
it: Backup non riuscito: il dispositivo è di sola lettura!

source: Backup failed: Required files not found!
it: Backup non riuscito: file richiesti non trovati!

source: Backup failed: Network connection lost!
it: Backup non riuscito: connessione di rete persa!

source: Backup failed! Last errors:
it: Backup fallito! Ultimi errori:

source: Backup failed! Check log: {0}
it: Backup fallito! Controlla il registro: {0}

source: Select the folder with backup
it: Selezionare la cartella con backup

source: current: {0}
it: corrente: {0}

source: Current: {0}
it: Attuale: {0}

source: Unzip
it: Scompattare

source: Flash
it: Flashing

source: About
it: Info

source: Delete
it: Eliminare

source: You are using dual multiboot!
it: Si sta usando il dual multiboot!

source: Warning! Use at your own risk! Make always a backup before use! Don't use it if you use multiple ubi volumes in ubi layer!
it: Attenzione ! !!! Usare a proprio rischio !!! Eseguire sempre un backup prima di usare! Non usare con volumi ubi multipli in ubi layer!

source: Run flash
it: Iniziare il Flash

source: Select parameter for start flash!
it: Selezionare i parametri per iniziare il flash!

source: For flashing your receiver files are needed:
it: Per eseguire un flash del ricevitore è necessario il file:

source: The found files:
it: File trovati:

source: {0} (maybe ok)
it: {0} (possibile OK)

source: {0} (maybe error)
it: {0} (possibile errore)

source: nothing!
it: niente!

source: Simulate (no write)
it: Simulazione (non esecuzione)

source: Standard (root and kernel)
it: Standard (root e kernel)

source: Only root
it: Solo root

source: Only kernel
it: Solo kernel

source: Simulate second partition (no write)
it: Simula seconda partizione (nessuna scrittura)

source: Second partition (root and kernel)
it: Seconda partizione (root e kernel)

source: Second partition (only root)
it: Seconda partizione (solo root)

source: Second partition (only kernel)
it: Seconda partizione (solo kernel)

source: Exit
it: Uscire

source: A recording is currently running. Please stop the recording before trying to start a flashing.
it: Una registrazione è in corso. Si prega di fermare la registrazione prima di iniziare il flashing.

source: NOT found files for flashing!
it: File per il flash non trovati!

source: Show only found image and mtd partitions.
it: Mostrare solo le immagini trovate e la partizione MTD.

source: ofgwrite will stop enigma2 now to run the flash.
it: il programma ofgwrite fermerà Enigma2 per iniziare il processo di flashing.

source: Your STB will freeze during the flashing process.
it: Il ricevitore si fermerà durante il processo di flashing.

source: Please: DO NOT reboot your STB and turn off the power.
it: Attenzione: NON eseguire un riavvio o spegnere il ricevitore !

source: The image or kernel will be flashing and auto booted in few minutes.
it: L'immagine o il kernel sarà flashato e automaticamente avviato in alcuni minuti

source: Do you really want to unpack {0} ?
it: Vuoi davvero decomprimere {0}?

source: Backup info
it: Info Backup

source: You are about to delete this backup: {0} Continue?
it: Si sta per eliminare questo backup: {0} Continuare?

source: Delete backup
it: Eliminare Backup

source: Welcome to BackupSuite help.
it: Benvenuti alla guida di BackupSuite.

source: Device List:
it: Lista Dispositivi:

source: • Use UP/DOWN buttons to navigate through backup options
it: • Utilizzare i pulsanti SU/GIÙ per navigare tra le opzioni di backup

source: • Press OK to select an option
it: • Premere OK per selezionare un'opzione

source: Backup Options:
it: Opzioni Backup:

source: • HDD Backup: Full system backup to internal hard drive
it: • Backup HDD: backup completo del sistema su disco rigido

source: • USB Backup: Create a bootable USB recovery stick
it: • Backup USB: crea una chiavetta USB di ripristino avviabile

source: • MMC Backup: Backup to external storage (eMMC)
it: • Backup MMC: backup su memoria interna (eMMC)

source: • NET Backup: Backup to network storage (NAS/SMB)
it: • NET Backup: backup su storage di rete (NAS/SMB)

source: • Barry Allen: Multiboot backup (if installed)
it: • Barry Allen: backup multiboot (se installato)

source: • Restore: Flash a previously created backup or image
it: • Ripristina: esegui il flashing di un backup o di un'immagine creati in precedenza.

source: Button Functions:
it: Funzioni dei pulsanti:

source: • GREEN: Start backup for selected device
it: • VERDE: Avvia il backup per il dispositivo selezionato

source: • YELLOW: Start restore process
it: • GIALLO: Avvia il processo di ripristino

source: • BLUE: Show this help screen
it: • BLU: Mostra questa schermata di aiuto

source: • RED: Close BackupSuite
it: • ROSSO: Chiudi BackupSuite

source: NET Backup Instructions:
it: Istruzioni per il backup NET:

source: 1. Mount your network share first:
it: 1. Per prima cosa, monta la tua condivisione di rete:

source: - Go to Main Menu > Setup > System > Storage Manager
it: - Vai a Menu principale > Impostazioni > Sistema > Gestione archiviazione

source: - Select 'Network Storage' and add your NAS/SMB share
it: - Seleziona "Archiviazione di rete" e aggiungi la tua condivisione NAS/SMB

source: - Enter server IP, share name, username and password
it: - Inserisci l'IP del server, il nome della condivisione, il nome utente e la password

source: - Mount the share and assign a name (e.g., NET_BACKUP)
it: - Montare la condivisione e assegnare un nome (ad esempio, NET_BACKUP)

source: 2. Select 'NET Backup' from the device list
it: 2. Selezionare 'NET Backup' dall'elenco dei dispositivi

source: 3. Choose your mounted network share
it: 3. Scegli la condivisione di rete montata

source: 4. Confirm and start the backup process
it: 4. Confermare e avviare il processo di backup

source: Best Practices:
it: Buone pratiche:

source: - Keep regular backups of your system
it: - Esegui regolarmente backup del tuo sistema

source: - Verify you have enough free storage space
it: - Assicurati di avere sufficiente spazio di archiviazione

source: - Never interrupt backup/restore processes
it: - Non interrompere mai i processi di backup/ripristino

source: - Use quality USB drives for recovery sticks
it: - Utilizzare unità USB di qualità per le chiavette di ripristino

source: - For network backups, use wired connection instead of Wi-Fi
it: - Per i backup di rete, utilizzare la connessione cablata anziché Wi-Fi

source: Technical Notes:
it: Note Tecniche:

source: - HDD backups: Stored in /media/hdd/backup
it: - Backup HDD: archiviati in /media/hdd/backup

source: - USB backups: Require FAT32-formatted drive with 'backupstick' file
it: - Il backup USB richiede una chiavetta USB formattata FAT con un file 'backupstick' o 'backupstick.txt' nella root.

source: - NET backups: Require mounted CIFS/NFS share with write permissions
it: - Backup NET: richiedono condivisione CIFS/NFS montata con permessi di scrittura

source: - Restore: Works from HDD, USB, NET or MMC storage
it: - Ripristino: funziona da HDD, USB, NET o storage MMC

source: - Always choose 'Standard (root and kernel)' when restoring
it: - Utilizzare sempre l'opzione 'Standard (root e kernel)' durante il ripristino

source: Troubleshooting NET Backup:
it: Risoluzione dei problemi di NET Backup:

source: - Ensure NAS is powered on and accessible
it: - Assicurarsi che il NAS sia acceso e accessibile

source: - Verify username/password are correct
it: - Verificare che nome utente/password siano corretti

source: - Check share permissions (read/write)
it: - Controllare i permessi di condivisione (lettura/scrittura)

source: - Test connection with ping command
it: - Testare la connessione con il comando ping

source: - Use IP address instead of hostname if DNS fails
it: - Utilizzare l'indirizzo IP invece del nome host se il DNS fallisce

source: For detailed instructions and support:
it: Per istruzioni dettagliate e supporto:

source: Visit our GitHub repository:
it: Visita il nostro repository GitHub:

source: What is new since the last release?
it: Novità rispetto all'ultima versione?

source: Please wait
it: Attendere prego

source: Change log not available
it: Registro delle modifiche non disponibile

source: Backup and restore your image
it: Esegui il backup e il ripristino dell'immagine
